/**
 * 后台JSON通用返回结构
 * @type {{code: number, data: number, success: boolean, message: string}}
 */
let  ajaxReponse = {
     version  : 1,
     requestId : "bc44f7c4-86ba-4965-94ad-074ec0ed80a8",
     time    : "2018-09-08 12:12:12",
     code    : 200,   //返回状态码 200请求正常
     success : true,  //操作成功
     message : "成功", //返回消息
     data    : [] | {} | String | Object | null,  //返回数据     具体内容参考对应的业务模块
     dataExt : [] | {} | String | Object | null,  //返回扩展数据  具体内容参考对应的业务模块(保留)
}

/**
 * ==============================
 *  更改信息
 * ==============================
 *  2019-07-24 15:16:18 
 */                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              


/**
 * ====================================
 *  2.1	电力采集数据功能模块 【【测点数据】】
 * ====================================
 */
/**
 *  2.1.1 查询测点【日单条】数据【不能跨企业查询】
 * 【请求URL】/app/da/mp/dayData
 * 【参数方式】GET|POST
 * 【请求参数】
 *  1.mpId         | 必填参数 | 测点标识
 *  1.dataDate     | 必填参数 | 数据日期  | (today=今日数据,yesterday=昨日数据,2019-07-12=指定某天) 具体常量参考TimeContants
 *  3.indBNo       | 必填参数 | 指标编号  | (01030004=总有功功率,01010001=A相电流 ......)
 *  4.pointCount   | 可选参数 | 数据频度  | (24=24个点,96=96个点,288=288个点,控制points数据显示数量}
 */
(function(){
let ajaxReponseData =
    {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "600359710482292737",  //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01030004",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01030004",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "总有功功率",      //指标名称
                classify : "0103"           //指标分类
            },
            dataDate: "2019-07-12",         //数据日期
            month   : "2019-07",            //数据月份
            lastTime: "2019-07-12 12:00:00",//最新数据时间
            lastVal : 239.02,               //最新数据值
            minTime : "2019-07-12 23:45:00",//最小数据时间
            minVal  : 26.24,                //最小数据值
            maxTime : "2019-07-12 13:45:00",//最大数据时间
            maxVal  : 321.24,               //最大数据值
            avgVal  : 268.92,               //平均数据时间
            points  : {                     //数据点位数据
                "00:00": 292,               //00:00的数据
                "00:05": 292,
                "00:10": 292,
                "23:55": 292,               //共计288个
            }
    }
})();

/**
 *  1.2.2 查询测点【日多条】数据集合
 * 【请求URL】/app/da/mp/dayDataList
 * 【参数方式】GET|POST
 * 【请求参数】
 *  1.timeType       | 必填参数 | 日期类型  | (day=日,week=周,month=月,year=年)
 *  2.timeData       | 必填参数 | 日期内容  |  day    = (today=今日数据,yesterday=昨日数据,[today,yesterday][2019-07-11,2019-07-11]=指定多天) 具体常量参考TimeContants
 *                                           week   =  (2=第二周)
 *                                           month  =  (theMonth=当月,lastMonth=上月,[2019-07,2019-08]=指定多个月份)
 *                                           year   =  (theYear =当年,lastYear =上年|去年,2018=2018年数据,2019=2019年数据)
 *  3.mpId           | 可选参数 | 测点标识  | (空=查询企业所有测点信息,[3232310004,32325510004]=多个测点
 *  4.unitId         | 可选参数 | 单元标识  | (空=忽略该查询,[10004,10005]=多个单元信息)
 *  5.indBNo         | 可选参数 | 指标编号  | (空=全部指标,01030004=总有功功率,01010001=A相电流,[01030004,01010001]总有功功率和A相电流 ......)
 *  6.dataDateCycle  | 可选参数 | 数据周期  | (1=同比,2=环比 ......) 自动增加同比、环比查询参数
 *  7.pointCount     | 可选参数 | 数据频度  | (24=24个点,96=96个点,288=288个点,控制points数据显示数量}
 *  8.orderBy        | 可选参数 | 排序      | orgNo asc,consName asc 多个排序字段用,隔开
 *  9.fill           | 可选参数 | 数据填充  | 例如查询一年数据,如果只有2个月的数据,则回补10个月空数据
 */
(function(){
    let ajaxReponseData =
    [
        {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "600359710482292737",  //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01030004",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01030004",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "总有功功率",      //指标名称
                classify : "0103"           //指标分类
            },
            dataDate: "2019-07-12",         //数据日期
            month   : "2019-07",            //数据月份
            lastTime: "2019-07-12 12:00:00",//最新数据时间
            lastVal : 239.02,               //最新数据值
            minTime : "2019-07-12 23:45:00",//最小数据时间
            minVal  : 26.24,                //最小数据值
            maxTime : "2019-07-12 13:45:00",//最大数据时间
            maxVal  : 321.24,               //最大数据值
            avgVal  : 268.92,               //平均数据时间
            points  : {                     //数据点位数据
                "00:00": 292,               //00:00的数据
                "00:05": 292,
                "00:10": 292,
                "23:55": 292,               //共计288个
            }
        },
        {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "700359710482292737",  //测点标识
            mpNo       : 2,                  //测点序号
            mpName     : "2#空压机",         //测点名称
            indBNo   : "01010001",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01010001",      //指标编号
                symbol   : "ia",            //指标符号
                name     : "A相电流",        //指标名称
                classify : "0101"           //指标分类
            },
            dataDate: "2019-07-12",         //数据日期
            month   : "2019-07",            //数据月份
            lastTime: "2019-07-12 12:00:00",//最新数据时间
            lastVal : 239.02,               //最新数据值
            minTime : "2019-07-12 23:45:00",//最小数据时间
            minVal  : 26.24,                //最小数据值
            maxTime : "2019-07-12 13:45:00",//最大数据时间
            maxVal  : 321.24,               //最大数据值
            avgVal  : 268.92,               //平均数据时间
            points  : {                     //数据点位数据
                "00:00": 292,               //00:00的数据
                "00:05": 292,
                "00:10": 292,
                "23:55": 292,               //共计288个
            }
        }
    ]
})();

/**
 * 1.2.2 查询测点【日单条】最值数据
 * 【请求URL】/app/da/mp/dayMostData
 * 【参数方式】GET|POST
 * 【请求参数】
 *  1.mpId         | 必填参数 | 测点标识
 *  1.dataDate     | 必填参数 | 数据日期  | (today=今日数据,yesterday=昨日数据,2019-07-12=指定某天) 具体常量参考TimeContants
 *  3.indBNo       | 必填参数 | 指标编号  | (01030004=总有功功率,01010001=A相电流 ......)
 *  4.pointCount   | 可选参数 | 数据频度  | (24=24个点,96=96个点,288=288个点,控制points数据显示数量}
 */
(function(){
    let ajaxReponseData =
        {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "600359710482292737",  //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01030004",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01030004",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "总有功功率",      //指标名称
                classify : "0103"           //指标分类
            },
            dataDate: "2019-07-12",         //数据日期
            month   : "2019-07",            //数据月份
            lastTime: "2019-07-12 12:00:00",//最新数据时间
            lastVal : 239.02,               //最新数据值
            minTime : "2019-07-12 23:45:00",//最小数据时间
            minVal  : 26.24,                //最小数据值
            maxTime : "2019-07-12 13:45:00",//最大数据时间
            maxVal  : 321.24,               //最大数据值
            avgVal  : 268.92,               //平均数据时间
        }
})();

/**
 * 1.2.2 查询测点【日多条】最值数据
 * 【请求URL】/app/da/mp/dayMostDataList
 * 【参数方式】GET|POST
 * 【请求参数】
 *  1.timeType       | 必填参数 | 日期类型  | (day=日,week=周,month=月,year=年)
 *  2.timeData       | 必填参数 | 日期内容  |  day    = (today=今日数据,yesterday=昨日数据,[today,yesterday][2019-07-11,2019-07-11]=指定多天) 具体常量参考TimeContants
 *                                           week   =  (2=第二周)
 *                                           month  =  (theMonth=当月,lastMonth=上月,[2019-07,2019-08]=指定多个月份)
 *                                           year   =  (theYear =当年,lastYear =上年|去年,2018=2018年数据,2019=2019年数据)
 *  3.mpId           | 可选参数 | 测点标识  | (空=查询企业所有测点信息,[3232310004,32325510004]=多个测点
 *  4.unitId         | 可选参数 | 单元标识  | (空=忽略该查询,[10004,10005]=多个单元信息)
 *  5.indBNo         | 可选参数 | 指标编号  | (空=全部指标,01030004=总有功功率,01010001=A相电流,[01030004,01010001]总有功功率和A相电流 ......)
 *  6.dataDateCycle  | 可选参数 | 数据周期  | (1=同比,2=环比 ......) 自动增加同比、环比查询参数
 *  7.orderBy        | 可选参数 | 排序      | orgNo asc,consName asc 多个排序字段用,隔开
 *  8.fill           | 可选参数 | 数据填充  | 例如查询一年数据,如果只有2个月的数据,则回补10个月空数据
 */
(function(){
    let ajaxReponseData =
    [
        {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "600359710482292737",  //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01030004",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01030004",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "总有功功率",      //指标名称
                classify : "0103"           //指标分类
            },
            dataDate: "2019-07-01",         //数据日期
            month   : "2019-07",            //数据月份
            lastTime: "2019-07-01 12:00:00",//最新数据时间
            lastVal : 239.02,               //最新数据值
            minTime : "2019-07-01 23:45:00",//最小数据时间
            minVal  : 26.24,                //最小数据值
            maxTime : "2019-07-01 13:45:00",//最大数据时间
            maxVal  : 321.24,               //最大数据值
            avgVal  : 268.92,               //平均数据时间
        },
        {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "700359710482292737",  //测点标识
            mpNo       : 2,                  //测点序号
            mpName     : "2#空压机",         //测点名称
            indBNo   : "01030004",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01030004",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "总有功功率",      //指标名称
                classify : "0103"           //指标分类
            },
            dataDate: "2019-07-12",         //数据日期
            month   : "2019-07",            //数据月份
            lastTime: "2019-07-12 12:00:00",//最新数据时间
            lastVal : 239.02,               //最新数据值
            minTime : "2019-07-12 23:45:00",//最小数据时间
            minVal  : 26.24,                //最小数据值
            maxTime : "2019-07-12 13:45:00",//最大数据时间
            maxVal  : 321.24,               //最大数据值
            avgVal  : 268.92,               //平均数据时间
        }
    ]   
})();

/**
 * 1.2.2 查询测点【日单条】用量数据
 * 【请求URL】/app/da/mp/dayDosageData
 * 【参数方式】GET|POST
 * 【请求参数】
 *  1.mpId         | 必填参数 | 测点标识
 *  1.dataDate     | 必填参数 | 数据日期  | (today=今日数据,yesterday=昨日数据,2019-07-12=指定某天)
 *  3.indBNo       | 必填参数 | 指标编号  | (01030004=总有功功率,01010001=A相电流 ......)
 *  4.pointCount   | 可选参数 | 数据频度  | (24=24个点,96=96个点,288=288个点,控制points数据显示数量}
 */
(function(){
    let ajaxReponseData =
        {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "600359710482292737",  //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01040001",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01040001",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "正向有功电能示值",      //指标名称
                classify : "0104"           //指标分类
            },       
            dataDate: "2019-07-12",         //数据日期
            month   : "2019-07",            //数据月份
            tip     : null,                 //尖峰用量
            peak : 239.02,                  //峰用量
            flat : 323,                     //平峰用量
            valley  : 26.24,                //谷用量
            total : 588.26,                 //合计用量

        }
})();


/**
 * 1.2.2 查询测点【日多条】用量数据
 * 【请求URL】/app/da/mp/dayDosageDataList
 * 【参数方式】GET|POST
 * 【请求参数】
 *  1.timeType       | 必填参数 | 日期类型  | (day=日,week=周,month=月,year=年)
 *  2.timeData       | 必填参数 | 日期内容  |  day    = (today=今日数据,yesterday=昨日数据,[today,yesterday][2019-07-11,2019-07-11]=指定多天) 具体常量参考TimeContants
 *                                           week   =  (2=第二周)
 *                                           month  =  (theMonth=当月,lastMonth=上月,[2019-07,2019-08]=指定多个月份)
 *                                           year   =  (theYear =当年,lastYear =上年|去年,2018=2018年数据,2019=2019年数据)
 *  3.mpId           | 可选参数 | 测点标识  | (空=查询企业所有测点信息,[3232310004,32325510004]=多个测点
 *  4.unitId         | 可选参数 | 单元标识  | (空=忽略该查询,[10004,10005]=多个单元信息)
 *  5.indBNo         | 可选参数 | 指标编号  | (空=全部指标,01030004=总有功功率,01010001=A相电流,[01030004,01010001]总有功功率和A相电流 ......)
 *  6.dataDateCycle  | 可选参数 | 数据周期  | (1=同比,2=环比 ......) 自动增加同比、环比查询参数
 *  7.orderBy        | 可选参数 | 排序      | orgNo asc,consName asc 多个排序字段用,隔开
 *  8.fill           | 可选参数 | 数据填充  | 例如查询一年数据,如果只有2个月的数据,则回补10个月空数据
 */
(function(){
    let ajaxReponseData =
     [
       {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "600359710482292737",  //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01040001",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01040001",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "正向有功电能示值",      //指标名称
                classify : "0104"           //指标分类
            },
            dataDate: "2019-07-01",         //数据日期
            month   : "2019-07",            //数据月份
            tip     : null,                 //尖峰用量
            peak : 239.02,                  //峰用量
            flat : 323,                     //平峰用量
            valley  : 26.24,                //谷用量
            total : 588.26,                 //合计用量
        },
        {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "700359710482292737",  //测点标识
            mpNo       : 2,                  //测点序号
            mpName     : "2#空压机",         //测点名称
            indBNo   : "01040001",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01040001",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "正向有功电能示值",      //指标名称
                classify : "0104"           //指标分类
            },
            dataDate: "2019-07-12",         //数据日期
            month   : "2019-07",            //数据月份
            tip     : null,                 //尖峰用量
            peak : 239.02,                  //峰用量
            flat : 323,                     //平峰用量
            valley  : 26.24,                //谷用量
            total : 588.26,                 //合计用量
        }
     ]   
})();

/**
 * 1.2.2 查询测点【日单条】抄表示数
 * 【请求URL】/app/da/mp/dayReadings
 * 【参数方式】GET|POST
 * 【请求参数】
 *  1.mpId         | 必填参数 | 测点标识
 *  1.dataDate     | 必填参数 | 数据日期  | (today=今日数据,yesterday=昨日数据,2019-07-12=指定某天)
 *  3.indBNo       | 必填参数 | 指标编号  | (01030004=总有功功率,01010001=A相电流 ......)
 *  4.pointCount   | 可选参数 | 数据频度  | (24=24个点,96=96个点,288=288个点,控制points数据显示数量}
 */
(function(){
    let ajaxReponseData =
        {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "600359710482292737", //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01040001",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01040001",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "正向有功电能示值",      //指标名称
                classify : "0104"           //指标分类
            },
            rDate     : "2019-07-12",         //抄表日期
            lDataTime : "2019-07-01 23:45:00",//上期示数抄表时间
            lNum      : 26.24,                //上期示数
            lDataTime : "2019-07-01 23:45:00",//本期示数抄表时间
            lNum      : 26.24,                //本期示数
            rate      : 13.2,                 //倍率

        }
})();

/**
 * 1.2.2 查询测点【日多条】抄表示数
 * 【请求URL】/app/da/mp/dayReadingsList
 * 【参数方式】GET|POST
 * 【请求参数】
 *  1.timeType       | 必填参数 | 日期类型  | (day=日,week=周,month=月,year=年)
 *  2.timeData       | 必填参数 | 日期内容  |  day    = (today=今日数据,yesterday=昨日数据,[today,yesterday][2019-07-11,2019-07-11]=指定多天) 具体常量参考TimeContants
 *                                           week   =  (2=第二周)
 *                                           month  =  (theMonth=当月,lastMonth=上月,[2019-07,2019-08]=指定多个月份)
 *                                           year   =  (theYear =当年,lastYear =上年|去年,2018=2018年数据,2019=2019年数据)
 *  3.mpId           | 可选参数 | 测点标识  | (空=查询企业所有测点信息,[3232310004,32325510004]=多个测点
 *  4.unitId         | 可选参数 | 单元标识  | (空=忽略该查询,[10004,10005]=多个单元信息)
 *  5.indBNo         | 可选参数 | 指标编号  | (空=全部指标,01030004=总有功功率,01010001=A相电流,[01030004,01010001]总有功功率和A相电流 ......)
 *  6.dataDateCycle  | 可选参数 | 数据周期  | (1=同比,2=环比 ......) 自动增加同比、环比查询参数
 *  7.orderBy        | 可选参数 | 排序      | orgNo asc,consName asc 多个排序字段用,隔开
 *  8.fill           | 可选参数 | 数据填充  | 例如查询一年数据,如果只有2个月的数据,则回补10个月空数据
 */
(function(){
    let ajaxReponseData =
        [
          {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : 600359710482292737, //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01040001",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01040001",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "正向有功电能示值",      //指标名称
                classify : "0104"           //指标分类
            },
            rDate     : "2019-07-11",         //抄表日期
            lDataTime : "2019-07-11 00:00:00",//上期示数抄表时间
            lNum      : 26.24,                //上期示数
            lDataTime : "2019-07-11 23:45:00",//本期示数抄表时间
            lNum      : 26.24,                //本期示数
            rate      : 13.2,                 //倍率
          },
           {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "600359710482292737", //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01040001",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01040001",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "正向有功电能示值",      //指标名称
                classify : "0104"           //指标分类
            },
            rDate     : "2019-07-12",         //抄表日期
            lDataTime : "2019-07-12 00:00:00",//上期示数抄表时间
            lNum      : 26.24,                //上期示数
            lDataTime : "2019-07-12 23:45:00",//本期示数抄表时间
            lNum      : 26.24,                //本期示数
            rate      : 13.2,                 //倍率
          }
       ]
})();



/**
 * 1.2.2 查询测点【月多条】数据
 * 【请求URL】/app/da/mp/monthDataList
 * 【参数方式】GET|POST
 * 【请求参数】 
 *  1.timeType       | 必填参数 | 日期类型  | (day=日,week=周,month=月,year=年)
 *  2.timeData       | 必填参数 | 日期内容  |  day    = (today=今日数据,yesterday=昨日数据,[today,yesterday][2019-07-11,2019-07-11]=指定多天)  具体常量参考TimeContants
 *                                           week   =  (2=第二周)
 *                                           month  =  (theMonth=当月,lastMonth=上月,[2019-07,2019-08]=指定多个月份)
 *                                           year   =  (theYear =当年,lastYear =上年|去年,2018=2018年数据,2019=2019年数据)
 *  3.mpId           | 可选参数 | 测点标识  | (空=查询企业所有测点信息,[3232310004,32325510004]=多个测点
 *  4.unitId         | 可选参数 | 单元标识  | (空=忽略该查询,[10004,10005]=多个单元信息)
 *  5.indBNo         | 可选参数 | 指标编号  | (空=全部指标,01030004=总有功功率,01010001=A相电流,[01030004,01010001]总有功功率和A相电流 ......)
 *  6.dataDateCycle  | 可选参数 | 数据周期  | (1=同比,2=环比 ......) 自动增加同比、环比查询参数
 *  7.pointCount     | 可选参数 | 数据频度  | (24=24个点,96=96个点,288=288个点,控制points数据显示数量}
 *  8.orderBy        | 可选参数 | 排序      | orgNo asc,consName asc 多个排序字段用,隔开
 *  9.fill           | 可选参数 | 数据填充  | 例如查询一年数据,如果只有2个月的数据,则回补10个月空数据
 */
(function(){
    let ajaxReponseData =
     [ 
        {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "600359710482292737",  //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01030004",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01030004",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "总有功功率",      //指标名称
                classify : "0103"           //指标分类
            },
            dataMonth : "2019-06",          //数据月份
            minTime : "2019-06-01 23:45:00",//最小数据时间
            minVal  : 26.24,                //最小数据值
            maxTime : "2019-06-12 13:45:00",//最大数据时间
            maxVal  : 321.24,               //最大数据值
            avgVal  : 268.92,               //平均数据时间
        },
        {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "600359710482292737",  //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01030004",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01030004",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "总有功功率",      //指标名称
                classify : "0103"           //指标分类
            },
            dataMonth : "2019-07",          //数据月份
            minTime : "2019-07-01 23:45:00",//最小数据时间
            minVal  : 26.24,                //最小数据值
            maxTime : "2019-07-12 13:45:00",//最大数据时间
            maxVal  : 321.24,               //最大数据值
            avgVal  : 268.92,               //平均数据时间
        }
    ]    
})();

/**
 * 1.2.2 查询测点【月单条】用量数据
 * 【请求URL】/app/da/mp/monthDosageData
 * 【参数方式】GET|POST
 * 【请求参数】
 *  1.mpId       | 必填参数 | 测点标识
 *  2.dataMonth  | 必填参数 | 数据日期  | (theMonth=当月,lastMonth=上月,2019-07=指定月份)
 *  3.unitTypeNo | 必填参数 | 单元编号  | (1=用户,2=建筑,3=厂房 ......)
 *  4.indBNo     | 必填参数 | 指标编号  | (01030004=总有功功率,01010001=A相电流 ......)
 */
(function(){
    let ajaxReponseData =
        {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "600359710482292737",  //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01040001",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01040001",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "正向有功电能示值",//指标名称
                classify : "0104"           //指标分类
            },
            month   : "2019-07",            //数据月份
            tip     : null,                 //尖峰用量
            peak : 239.02,                  //峰用量
            flat : 323,                     //平峰用量
            valley  : 26.24,                //谷用量
            total : 588.26,                 //合计用量
        }
})();


/**
 * 1.2.2 查询测点【月用条】用量数据
 * 【请求URL】/app/da/mp/monthDosageDataList
 * 【参数方式】GET|POST
 * 【请求参数】
 *  1.timeType       | 必填参数 | 日期类型  | (month=月,year=年)
 *  2.timeData       | 必填参数 | 日期内容  |  month  =  (theMonth=当月,lastMonth=上月,[2019-07,2019-08]=指定多个月份)  具体常量参考TimeContants
 *                                           year   =  (theYear =当年,lastYear =上年|去年,2018=2018年数据,2019=2019年数据)
 *  3.mpId           | 可选参数 | 测点标识  | (空=查询企业所有测点信息,[3232310004,32325510004]=多个测点
 *  4.unitId         | 可选参数 | 单元标识  | (空=忽略该查询,[10004,10005]=多个单元信息)
 *  5.indBNo         | 可选参数 | 指标编号  | (空=全部指标,01030004=总有功功率,01010001=A相电流,[01030004,01010001]总有功功率和A相电流 ......)
 *  6.dataDateCycle  | 可选参数 | 数据周期  | (1=同比,2=环比 ......) 自动增加同比、环比查询参数
 *  7.pointCount     | 可选参数 | 数据频度  | (24=24个点,96=96个点,288=288个点,控制points数据显示数量}
 *  8.orderBy        | 可选参数 | 排序      | orgNo asc,consName asc 多个排序字段用,隔开
 *  9.fill           | 可选参数 | 数据填充  | 例如查询一年数据,如果只有2个月的数据,则回补10个月空数据
 */
(function(){
    let ajaxReponseData =
     [
        {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "600359710482292737",  //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01040001",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01040001",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "正向有功电能示值", //指标名称
                classify : "0104"           //指标分类
            },
            month   : "2019-06",            //数据月份
            tip     : null,                 //尖峰用量
            peak : 239.02,                  //峰用量
            flat : 323,                     //平峰用量
            valley  : 26.24,                //谷用量
            total : 588.26,                 //合计用量
        },
        {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "600359710482292737",  //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01040001",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01040001",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "正向有功电能示值", //指标名称
                classify : "0104"           //指标分类
            },
            month   : "2019-07",            //数据月份
            tip     : null,                 //尖峰用量
            peak : 239.02,                  //峰用量
            flat : 323,                     //平峰用量
            valley  : 26.24,                //谷用量
            total : 588.26,                 //合计用量
        }
     ]   
})();

/**
 * 1.2.2 查询测点【月单条】抄表示数
 * 【请求URL】/app/da/mp/monthReadings
 * 【参数方式】GET|POST
 * 【请求参数】
 *  1.mpId         | 必填参数 | 测点标识
 *  1.dataDate     | 必填参数 | 数据日期  | (today=今日数据,yesterday=昨日数据,2019-07-12=指定某天)
 *  3.indBNo       | 必填参数 | 指标编号  | (01030004=总有功功率,01010001=A相电流 ......)
 *  4.pointCount   | 可选参数 | 数据频度  | (24=24个点,96=96个点,288=288个点,控制points数据显示数量}
 */
(function(){
    let ajaxReponseData =
        {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "600359710482292737", //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01030004",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01040001",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "正向有功电能示值",      //指标名称
                classify : "0104"           //指标分类
            },
            dataMonth : "2019-07",         //抄表日期
            lDataTime : "2019-07-01 23:45:00",//上期示数抄表时间
            lNum      : 26.24,                //上期示数
            lDataTime : "2019-07-01 23:45:00",//本期示数抄表时间
            lNum      : 26.24,                //本期示数
            rate      : 13.2,                 //倍率
        }
})();

/**
 * 1.2.2 查询测点【月多条】抄表示数
 * 【请求URL】/app/da/mp/monthReadingsList
 * 【参数方式】GET|POST
 * 【请求参数】
 *  1.timeType       | 必填参数 | 日期类型  | (month=月,year=年)
 *  2.timeData       | 必填参数 | 日期内容  |  month  =  (theMonth=当月,lastMonth=上月,[2019-07,2019-08]=指定多个月份)    具体常量参考TimeContants
 *                                           year   =  (theYear =当年,lastYear =上年|去年,2018=2018年数据,2019=2019年数据)
 *  3.mpId           | 可选参数 | 测点标识  | (空=查询企业所有测点信息,[3232310004,32325510004]=多个测点
 *  4.unitId         | 可选参数 | 单元标识  | (空=忽略该查询,[10004,10005]=多个单元信息)
 *  5.indBNo         | 可选参数 | 指标编号  | (空=全部指标,01030004=总有功功率,01010001=A相电流,[01030004,01010001]总有功功率和A相电流 ......)
 *  6.dataDateCycle  | 可选参数 | 数据周期  | (1=同比,2=环比 ......) 自动增加同比、环比查询参数
 *  7.orderBy        | 可选参数 | 排序      | orgNo asc,consName asc 多个排序字段用,隔开
 *  8.fill           | 可选参数 | 数据填充  | 例如查询一年数据,如果只有2个月的数据,则回补10个月空数据
 */
(function(){
    let ajaxReponseData =
        [
          {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "600359710482292737", //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01030004",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01040001",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "正向有功电能示值",      //指标名称
                classify : "0104"           //指标分类
            },
            dataMonth : "2019-06",         //抄表日期
            lDataTime : "2019-06-11 00:00:00",//上期示数抄表时间
            lNum      : 26.24,                //上期示数
            lDataTime : "2019-06-11 23:45:00",//本期示数抄表时间
            lNum      : 26.24,                //本期示数
            rate      : 13.2,                 //倍率
          },
          {
            consNo     : "0181821212",      //企业编号
            consName   : "高速齿轮有限公司",  //企业名称
            mpId       : "600359710482292737", //测点标识
            mpNo       : 1,                  //测点序号
            mpName     : "1#空压机",         //测点名称
            indBNo   : "01030004",          //指标编号
            index   :{                      //指标对象
                indBNo   : "01040001",      //指标编号
                symbol   : "szpw",          //指标符号
                name     : "正向有功电能示值",      //指标名称
                classify : "0104"           //指标分类
            },
            dataMonth : "2019-07",         //抄表日期
            lDataTime : "2019-07-12 00:00:00",//上期示数抄表时间
            lNum      : 26.24,                //上期示数
            lDataTime : "2019-07-12 23:45:00",//本期示数抄表时间
            lNum      : 26.24,                //本期示数
            rate      : 13.2,                 //倍率
          }
       ]
})();
